#!/bin/bash
# Made by K.H.
# 2021-06-07

#My account name
ID=$(pwd | cut -d"/" -f3) 

echo "
#로그인 시, 내가 넣은 작업 목록 출력
if [[ -f ~/.log ]]
then
bash ~/.log
fi" >> ~/.bashrc

echo "#!/bin/sh
echo \"=============================================================================\"
echo \"                          PLEASE CHECK YOUR JOBS NOW!                        \"
echo \"=============================================================================\"
ps -ef | grep $ID
echo \"=============================================================================\"
" >> ~/.log

source ~/.bashrc
